lab11_ci/ci4/app/Views/components/artikel_terkini.php

<body>
    <?php
    $model = new \App\Models\ArtikelModel();
    $artikel = $model->select('artikel.*, kategori.nama_kategori')
        ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
        ->where('status', 'published')
        ->orderBy('created_at', 'DESC')
        ->limit(5)
        ->find();
---
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `status` = 'published'
ORDER BY `created_at` DESC
 LIMIT 5