lab11_ci/ci4/app/Controllers/AjaxController.php

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
---
    public function getData()
    {
        $model = new ArtikelModel();
        $data = $model->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
            ->findAll();

INSERT INTO `artikel` (`judul`, `isi`, `slug`, `id_kategori`) VALUES ('tes ajax', 'testes', 'tes-ajax', '102')
---
    public function tambah()
    {
        $model = new ArtikelModel();

        $data = [
            'judul'       => $this->request->getPost('judul'),
            'isi'         => $this->request->getPost('isi'),
            'slug'        => url_title($this->request->getPost('judul'), '-', true),
            'id_kategori' => $this->request->getPost('id_kategori')
        ];

        if ($model->insert($data)) {

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '73'
---
    public function getArtikel($id)
    {
        $model = new ArtikelModel();
        $data = $model->find($id);