lab11_ci/ci4/app/Controllers/Artikel.php

    public function add()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
            'isi' => 'required', // Tambah validasi untuk isi
            'id_kategori' => 'required|is_natural_no_zero' // Ganti kategori dengan id_kategori
        ]);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $file = $this->request->getFile('gambar');
            $namaFile = $file->getName();
            if ($file->isValid() && !$file->hasMoved()) {
                $file->move(ROOTPATH . 'public/gambar');
            }

            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
                'id_kategori' => $this->request->getPost('id_kategori'), // Ganti kategori dengan id_kategori
                'gambar' => $namaFile
            ]);
            return redirect()->to('admin/artikel')->with('success', 'Artikel berhasil ditambahkan'); // Tambah pesan sukses
        }

        $kategoriModel = new \App\Models\KategoriModel();
        $kategori = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function edit($id)
    {
        $artikel = new \App\Models\ArtikelModel();

        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
            'id_kategori' => 'required' // Tambah validasi kategori
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $artikel->update($id, [
                'judul'        => $this->request->getPost('judul'),
                'isi'          => $this->request->getPost('isi'),
                'id_kategori'  => $this->request->getPost('id_kategori') // Simpan kategori ID
            ]);
            return redirect()->to('admin/artikel'); // Redirect ke halaman admin
        }

        // Ambil data lama
        $data = $artikel->where('id', $id)->first();
        $title = "Edit Artikel";

        $kategoriModel = new \App\Models\KategoriModel();
        $kategori = $kategoriModel->findAll();
---
SELECT *
FROM `artikel`
WHERE `id` = '67'
 LIMIT 1
SELECT *
FROM `kategori`