lab11_ci/ci4/app/Cells/ArtikelTerkini.php

SELECT *
FROM `artikel`
WHERE `kategori` IN (5)
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function tampil($kategori = null)
    {
        $model = new ArtikelModel();

        if (!empty($kategori) && is_array($kategori)) {
            $model->whereIn('kategori', $kategori);
        } elseif (!empty($kategori)) {
            $model->where('kategori', $kategori);
        }

        $artikel = $model->orderBy('created_at', 'DESC')->findAll(5);